tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Statistics utility to count lines of code
brew "cloc"
# USB programmer
brew "dfu-util"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Programming language for highly scalable real-time systems
brew "erlang"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# The Kubernetes package manager
brew "helm"
# Migrate or backup IMAP mail accounts
brew "imapsync"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Sophisticated file transfer program
brew "lftp"
# Run a Kubernetes cluster locally
brew "minikube", link: false
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Python dependency management tool
brew "pipenv"
# Tool to build, change, and version infrastructure
brew "terraform"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
cask "android-file-transfer"
cask "android-studio"
cask "blender"
cask "brave-browser"
cask "dash"
cask "dashlane"
cask "docker"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "google-backup-and-sync"
cask "google-cloud-sdk"
cask "handbrake"
cask "iterm2"
cask "kiibohd-configurator"
cask "ksdiff"
cask "logitech-options"
cask "miniconda"
cask "minikube"
cask "musescore"
cask "postman"
cask "qmk-toolbox"
cask "retroarch"
cask "sony-ps4-remote-play"
cask "telegram"
cask "tor-browser"
cask "transmit"
cask "vagrant"
cask "visual-studio-code"
