tap "dart-lang/dart"
tap "getsentry/tools"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# H.264/AVC encoder
brew "x264"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"
# Statistics utility to count lines of code
brew "cloc"
# USB programmer
brew "dfu-util"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Programming language for highly scalable real-time systems
brew "erlang"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Git-powered FTP client
brew "git-ftp"
# Git extension for versioning large files
brew "git-lfs"
# Alternative to top/htop
brew "glances"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image manipulation
brew "netpbm"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Migrate or backup IMAP mail accounts
brew "imapsync"
# Image loading and rendering library
brew "imlib2"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Sophisticated file transfer program
brew "lftp"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# YAML Parser
brew "libyaml"
# Run a Kubernetes cluster locally
brew "minikube", link: false
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# H.264 codec from Cisco
brew "openh264"
# Development kit for the Java programming language
brew "openjdk"
# Python dependency management tool
brew "pipenv"
# Tool to build, change, and version infrastructure
brew "terraform"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tools for building Android applications
cask "android-studio"
# Desktop password and login vault
cask "bitwarden"
# Free and open-source 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# VPN client for secure internet access and private browsing
cask "expressvpn"
cask "figma"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Command-line tool for the App Store version of Kaleidoscope
cask "ksdiff"
# Software for Logitech devices
cask "logitech-options"
cask "microsoft-teams"
cask "miniconda"
cask "minikube"
# Open-source music notation software
cask "musescore"
# Collaboration platform for API development
cask "postman"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
