tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
brew "carthage"
brew "certbot"
brew "circleci"
brew "cloc"
brew "dfu-util"
brew "ffmpeg"
brew "git-lfs"
brew "go"
brew "imapsync"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "nvm"
brew "pipenv"
brew "redis"
brew "terraform"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku/brew/heroku"
cask "android-studio"
cask "blender"
cask "dash"
cask "discord"
cask "docker"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "kiibohd-configurator"
cask "ksdiff"
cask "logitech-options"
cask "messenger"
cask "miniconda"
cask "minikube"
cask "netspot"
cask "postman"
cask "qmk-toolbox"
cask "visual-studio-code"
